esp-rs/esp-pacs/esp32c3/svd/esp32c3.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LEDC</name>
      <description>LED Control PWM (Pulse Width Modulation)</description>
      <groupName>LEDC</groupName>
      <baseAddress>0x60019000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LEDC</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIMER1</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>TIMER2</name>
        <value>31</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing CH?_CONF0, CH?_HPOINT, CH?_DUTY, CH?_CONF1, CH?_DUTY_R</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONF0</name>
            <description>LEDC_LSCH0_CONF0.</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMER_SEL</name>
                <description>reg_timer_sel_lsch0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SIG_OUT_EN</name>
                <description>reg_sig_out_en_lsch0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IDLE_LV</name>
                <description>reg_idle_lv_lsch0.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PARA_UP</name>
                <description>reg_para_up_lsch0.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OVF_NUM</name>
                <description>reg_ovf_num_lsch0.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF_CNT_EN</name>
                <description>reg_ovf_cnt_en_lsch0.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF_CNT_RESET</name>
                <description>reg_ovf_cnt_reset_lsch0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HPOINT</name>
            <description>LEDC_LSCH0_HPOINT.</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPOINT</name>
                <description>reg_hpoint_lsch0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUTY</name>
            <description>LEDC_LSCH0_DUTY.</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY</name>
                <description>reg_duty_lsch0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>19</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONF1</name>
            <description>LEDC_LSCH0_CONF1.</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <resetValue>0x40000000</resetValue>
            <fields>
              <field>
                <name>DUTY_SCALE</name>
                <description>reg_duty_scale_lsch0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DUTY_CYCLE</name>
                <description>reg_duty_cycle_lsch0.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DUTY_NUM</name>
                <description>reg_duty_num_lsch0.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DUTY_INC</name>
                <description>reg_duty_inc_lsch0.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DUTY_START</name>
                <description>reg_duty_start_lsch0.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUTY_R</name>
            <description>LEDC_LSCH0_DUTY_R.</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY_R</name>
                <description>reg_duty_lsch0_r.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>19</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TIMER%s</name>
          <description>Cluster TIMER%s, containing TIMER?_CONF, TIMER?_VALUE</description>
          <addressOffset>0xA0</addressOffset>
          <register>
            <name>CONF</name>
            <description>LEDC_LSTIMER0_CONF.</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00800000</resetValue>
            <fields>
              <field>
                <name>DUTY_RES</name>
                <description>reg_lstimer0_duty_res.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CLK_DIV</name>
                <description>reg_clk_div_lstimer0.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAUSE</name>
                <description>reg_lstimer0_pause.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RST</name>
                <description>reg_lstimer0_rst.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TICK_SEL</name>
                <description>reg_tick_sel_lstimer0.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PARA_UP</name>
                <description>reg_lstimer0_para_up.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VALUE</name>
            <description>LEDC_LSTIMER0_VALUE.</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT</name>
                <description>reg_lstimer0_cnt.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>14</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INT_RAW</name>
          <description>LEDC_INT_RAW.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>reg_lstimer%s_ovf_int_raw.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>Interrupt raw bit for channel %s. Triggered when the gradual change of duty has finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>Interrupt raw bit for channel %s. Triggered when the OVF_CNT has reached the value specified by LEDC.CHx.CONF0.OVF_NUM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>LEDC_INT_ST.</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>This is the masked interrupt status bit for the TIMER%s_OVF interrupt when LEDC.INT_ENA.TIMERx_OVF is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>This is the masked interrupt status bit for the DUTY_CHNG_END_CH%s interrupt when LEDC.INT_ENA.DUTY_CHNG_END_CHx is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>This is the masked interrupt status bit for the LEDC.INT_RAW.OVF_CNT_CH%s interrupt when LEDC.INT_ENA.OVF_CNT_CHx is set to 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>LEDC_INT_ENA.</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>The interrupt enable bit for the TIMER%s_OVF interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>The interrupt enable bit for the DUTY_CHNG_END_CH%s interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>The interrupt enable bit for the OVF_CNT_CH%s interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>LEDC_INT_CLR.</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>Set this bit to clear the TIMER%s_OVF interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>Set this bit to clear the DUTY_CHNG_END_CH%s interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>Set this bit to clear the OVF_CNT_CH%s interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>LEDC_CONF.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_CLK_SEL</name>
              <description>reg_apb_clk_sel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>reg_clk_en.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>LEDC_DATE.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x19061700</resetValue>
          <fields>
            <field>
              <name>LEDC_DATE</name>
              <description>reg_ledc_date.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
