esp-rs/esp-pacs/esp32c3/svd/esp32c3.base.svd
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_2</name>
          <description>SENSITIVE_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_2_REG</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_0</name>
              <description>core_x_iram0_sram_line_0_category_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_1</name>
              <description>core_x_iram0_sram_line_0_category_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_2</name>
              <description>core_x_iram0_sram_line_0_category_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_SPLITADDR</name>
              <description>core_x_iram0_sram_line_0_splitaddr</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_3</name>
          <description>SENSITIVE_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_3_REG</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_0</name>
              <description>core_x_iram0_sram_line_1_category_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_1</name>
              <description>core_x_iram0_sram_line_1_category_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_CATEGORY_2</name>
              <description>core_x_iram0_sram_line_1_category_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_1_SPLITADDR</name>
              <description>core_x_iram0_sram_line_1_splitaddr</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_4</name>
          <description>SENSITIVE_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_4_REG</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_0</name>
              <description>core_x_dram0_dma_sram_line_0_category_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_1</name>
              <description>core_x_dram0_dma_sram_line_0_category_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_CATEGORY_2</name>
              <description>core_x_dram0_dma_sram_line_0_category_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_0_SPLITADDR</name>
              <description>core_x_dram0_dma_sram_line_0_splitaddr</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_5</name>
          <description>SENSITIVE_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_5_REG</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_0</name>
              <description>core_x_dram0_dma_sram_line_1_category_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_1</name>
              <description>core_x_dram0_dma_sram_line_1_category_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_CATEGORY_2</name>
              <description>core_x_dram0_dma_sram_line_1_category_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_DMA_SRAM_LINE_1_SPLITADDR</name>
              <description>core_x_dram0_dma_sram_line_1_splitaddr</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_CORE_X_IRAM0_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_LOCK</name>
              <description>core_x_iram0_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_CORE_X_IRAM0_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x001C7FFF</resetValue>
          <fields>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>core_x_iram0_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>core_x_iram0_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>core_x_iram0_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>core_x_iram0_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_CACHEDATAARRAY_PMS_0</name>
              <description>core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_ROM_WORLD_1_PMS</name>
              <description>core_x_iram0_pms_constrain_rom_world_1_pms</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_PMS_CONSTRAIN_2</name>
          <description>SENSITIVE_CORE_X_IRAM0_PMS_CONSTRAIN_2_REG</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x001C7FFF</resetValue>
          <fields>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>core_x_iram0_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>core_x_iram0_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>core_x_iram0_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>core_x_iram0_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_CACHEDATAARRAY_PMS_0</name>
              <description>core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_PMS_CONSTRAIN_ROM_WORLD_0_PMS</name>
              <description>core_x_iram0_pms_constrain_rom_world_0_pms</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_0</name>
          <description>SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_0_REG</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_LOCK</name>
              <description>core_0_iram0_pms_monitor_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_1</name>
          <description>SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_1_REG</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_CLR</name>
              <description>core_0_iram0_pms_monitor_violate_clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_EN</name>
              <description>core_0_iram0_pms_monitor_violate_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_PMS_MONITOR_2</name>
          <description>SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_2_REG</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR</name>
              <description>core_0_iram0_pms_monitor_violate_intr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>core_0_iram0_pms_monitor_violate_status_wr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_LOADSTORE</name>
              <description>core_0_iram0_pms_monitor_violate_status_loadstore</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>core_0_iram0_pms_monitor_violate_status_world</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>core_0_iram0_pms_monitor_violate_status_addr</description>
              <bitOffset>5</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_DRAM0_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_CORE_X_DRAM0_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_LOCK</name>
              <description>core_x_dram0_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_DRAM0_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_CORE_X_DRAM0_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0FF0FF</resetValue>
          <fields>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>core_x_dram0_pms_constrain_sram_world_0_pms_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>core_x_dram0_pms_constrain_sram_world_0_pms_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>core_x_dram0_pms_constrain_sram_world_0_pms_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>core_x_dram0_pms_constrain_sram_world_0_pms_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>core_x_dram0_pms_constrain_sram_world_1_pms_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>core_x_dram0_pms_constrain_sram_world_1_pms_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>core_x_dram0_pms_constrain_sram_world_1_pms_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>core_x_dram0_pms_constrain_sram_world_1_pms_3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_ROM_WORLD_0_PMS</name>
              <description>core_x_dram0_pms_constrain_rom_world_0_pms</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_ROM_WORLD_1_PMS</name>
              <description>core_x_dram0_pms_constrain_rom_world_1_pms</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_0</name>
          <description>SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_0_REG</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_LOCK</name>
              <description>core_0_dram0_pms_monitor_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_1</name>
          <description>SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_1_REG</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_CLR</name>
              <description>core_0_dram0_pms_monitor_violate_clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_EN</name>
              <description>core_0_dram0_pms_monitor_violate_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_2</name>
          <description>SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_2_REG</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR</name>
              <description>core_0_dram0_pms_monitor_violate_intr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_LOCK</name>
              <description>core_0_dram0_pms_monitor_violate_status_lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>core_0_dram0_pms_monitor_violate_status_world</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>core_0_dram0_pms_monitor_violate_status_addr</description>
              <bitOffset>4</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_3</name>
          <description>SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_3_REG</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>core_0_dram0_pms_monitor_violate_status_wr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_BYTEEN</name>
              <description>core_0_dram0_pms_monitor_violate_status_byteen</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_LOCK</name>
              <description>core_0_pif_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
