esp-rs/esp-pacs/esp32c3/svd/esp32c3.base.svd
        <register>
          <name>QUICK_SENT</name>
          <description>a</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SINGLE_SEND_NUM</name>
              <description>a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLE_SEND_EN</name>
              <description>a</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_SEND_NUM</name>
              <description>a</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_SEND_EN</name>
              <description>a</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>7</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-6</dimIndex>
          <name>REG_Q%s</name>
          <description>Cluster REG_Q%s, containing REG_Q?_WORD0, REG_Q?_WORD1</description>
          <addressOffset>0x34</addressOffset>
          <register>
            <name>WORD0</name>
            <description>a</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEND_WORD</name>
                <description>a</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WORD1</name>
            <description>a</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEND_WORD</name>
                <description>a</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>ESC_CONF%s</name>
          <description>a</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DCDBC0</resetValue>
          <fields>
            <field>
              <name>SEPER_CHAR</name>
              <description>a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR0</name>
              <description>a</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR1</name>
              <description>a</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_THRES</name>
          <description>a</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>PKT_THRS</name>
              <description>a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>a</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x02007170</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UHCI0">
      <name>UHCI1</name>
      <description>Universal Host Controller Interface 1</description>
      <baseAddress>0x6000C000</baseAddress>
    </peripheral>
    <peripheral>
      <name>USB_DEVICE</name>
      <description>Full-speed USB Serial/JTAG Controller</description>
      <groupName>USB_DEVICE</groupName>
      <baseAddress>0x60043000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB_DEVICE</name>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <name>EP1</name>
          <description>USB_DEVICE_EP1_REG.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDWR_BYTE</name>
              <description>Write and read byte data to/from UART Tx/Rx FIFO through this field. When USB_DEVICE_SERIAL_IN_EMPTY_INT is set, then user can write data (up to 64 bytes) into UART Tx FIFO. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT is set, user can check USB_DEVICE_OUT_EP1_WR_ADDR USB_DEVICE_OUT_EP0_RD_ADDR to know how many data is received, then read data from UART Rx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EP1_CONF</name>
          <description>USB_DEVICE_EP1_CONF_REG.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>WR_DONE</name>
              <description>Set this bit to indicate writing byte data to UART Tx FIFO is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SERIAL_IN_EP_DATA_FREE</name>
              <description>1'b1: Indicate UART Tx FIFO is not full and can write data into in. After writing USB_DEVICE_WR_DONE, this bit would be 0 until data in UART Tx FIFO is read by USB Host.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SERIAL_OUT_EP_DATA_AVAIL</name>
              <description>1'b1: Indicate there is data in UART Rx FIFO.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>USB_DEVICE_INT_RAW_REG.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>JTAG_IN_FLUSH</name>
              <description>The raw interrupt bit turns to high level when flush cmd is received for IN endpoint 2 of JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF</name>
              <description>The raw interrupt bit turns to high level when SOF frame is received.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_OUT_RECV_PKT</name>
              <description>The raw interrupt bit turns to high level when Serial Port OUT Endpoint received one packet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_IN_EMPTY</name>
              <description>The raw interrupt bit turns to high level when Serial Port IN Endpoint is empty.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID_ERR</name>
              <description>The raw interrupt bit turns to high level when pid error is detected.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC5_ERR</name>
              <description>The raw interrupt bit turns to high level when CRC5 error is detected.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC16_ERR</name>
              <description>The raw interrupt bit turns to high level when CRC16 error is detected.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STUFF_ERR</name>
              <description>The raw interrupt bit turns to high level when stuff error is detected.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_TOKEN_REC_IN_EP1</name>
              <description>The raw interrupt bit turns to high level when IN token for IN endpoint 1 is received.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_BUS_RESET</name>
              <description>The raw interrupt bit turns to high level when usb bus reset is detected.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EP1_ZERO_PAYLOAD</name>
              <description>The raw interrupt bit turns to high level when OUT endpoint 1 received packet with zero palyload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EP2_ZERO_PAYLOAD</name>
              <description>The raw interrupt bit turns to high level when OUT endpoint 2 received packet with zero palyload.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>USB_DEVICE_INT_ST_REG.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JTAG_IN_FLUSH</name>
              <description>The raw interrupt status bit for the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SERIAL_OUT_RECV_PKT</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SERIAL_IN_EMPTY</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PID_ERR</name>
              <description>The raw interrupt status bit for the USB_DEVICE_PID_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC5_ERR</name>
              <description>The raw interrupt status bit for the USB_DEVICE_CRC5_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC16_ERR</name>
              <description>The raw interrupt status bit for the USB_DEVICE_CRC16_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STUFF_ERR</name>
              <description>The raw interrupt status bit for the USB_DEVICE_STUFF_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_TOKEN_REC_IN_EP1</name>
              <description>The raw interrupt status bit for the USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_BUS_RESET</name>
              <description>The raw interrupt status bit for the USB_DEVICE_USB_BUS_RESET_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EP1_ZERO_PAYLOAD</name>
              <description>The raw interrupt status bit for the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EP2_ZERO_PAYLOAD</name>
              <description>The raw interrupt status bit for the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>USB_DEVICE_INT_ENA_REG.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JTAG_IN_FLUSH</name>
              <description>The interrupt enable bit for the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF</name>
              <description>The interrupt enable bit for the USB_DEVICE_SOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_OUT_RECV_PKT</name>
              <description>The interrupt enable bit for the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_IN_EMPTY</name>
              <description>The interrupt enable bit for the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID_ERR</name>
              <description>The interrupt enable bit for the USB_DEVICE_PID_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC5_ERR</name>
              <description>The interrupt enable bit for the USB_DEVICE_CRC5_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC16_ERR</name>
              <description>The interrupt enable bit for the USB_DEVICE_CRC16_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STUFF_ERR</name>
              <description>The interrupt enable bit for the USB_DEVICE_STUFF_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_TOKEN_REC_IN_EP1</name>
              <description>The interrupt enable bit for the USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_BUS_RESET</name>
              <description>The interrupt enable bit for the USB_DEVICE_USB_BUS_RESET_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EP1_ZERO_PAYLOAD</name>
              <description>The interrupt enable bit for the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EP2_ZERO_PAYLOAD</name>
              <description>The interrupt enable bit for the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
